renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx71m/r_qspi_smstr_target.c
/*******************************************************************************
* Function Name: r_qspi_smstr_enable
* Description  : Enables QSPI and initializes registers.
* Arguments    : channel -
*                    Which channel to use
*                br_data -
*                    Setting of QSPI Bit Rate Register (SPBR)
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_enable(uint8_t channel, uint8_t br_data)
{
    r_qspi_smstr_module_enable(channel);            /* Cancel the Module Stop of QSPI.  */
    QSPI_SPCR(channel)      = QSPI_SPCR_INIT;
                                        /* Disable QSPI function and set master mode.   */
    if (QSPI_SPCR_INIT == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    QSPI_SSLP(channel)      = QSPI_SSLP_INIT;       /* Initialize SSLP.                 */
    QSPI_SPPCR(channel)     = QSPI_SPPCR_INIT;      /* Initialize SPPCR.                */
    QSPI_SPBR(channel)      = br_data;              /* Set bit rate.                    */
    QSPI_SPCKD(channel)     = QSPI_SPCKD_INIT;      /* Initialize SPCKD.                */
    QSPI_SSLND(channel)     = QSPI_SSLND_INIT;      /* Initialize SSLND.                */
    QSPI_SPND(channel)      = QSPI_SPND_INIT;       /* Initialize SPND.                 */
    QSPI_SPDCR(channel)     = QSPI_SPDCR_INIT;      /* Initialize SPDCR.                */
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flag of QSPI.       */
    QSPI_SPSCR(channel)     = QSPI_SPSCR_INIT;      /* Initialize SPSCR.                */
    QSPI_SPBFCR(channel)    = QSPI_SPBFCR_INIT;     /* Initialize SPBFCR.               */
    if (QSPI_SPBFCR_INIT == QSPI_SPBFCR(channel))
    {
        /* According to specifications of QSPI,
           if write SPBFCR, must execute dummy reading. */
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    QSPI_SPCMD0(channel)    = QSPI_SPCMD_INIT;      /* Initialize SPCMD0.               */
    QSPI_SPCMD1(channel)    = QSPI_SPCMD_INIT;      /* Initialize SPCMD1.               */
    QSPI_SPCMD2(channel)    = QSPI_SPCMD_INIT;      /* Initialize SPCMD2.               */
    if (QSPI_SPCMD_INIT  == QSPI_SPCMD2(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_disable
* Description  : Stops QSPI.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_disable(uint8_t channel)
{
    r_qspi_smstr_module_enable(channel);            /* Cancel the Module Stop of QSPI.  */
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flags of QSPI.      */
    r_qspi_smstr_module_disable(channel);           /* Set the Module Stop of QSPI.     */
}


/*******************************************************************************
* Function Name: r_qspi_smstr_change
* Description  : Changes setting of SPI clock mode and bit rate of QSPI.
* Arguments    : channel -
*                    Which channel to use
*                mode_num -
*                    Number of SPI clock mode
*                        0: CPOL=0, CPHA=0
*                        1: CPOL=0, CPHA=1
*                        2: CPOL=1, CPHA=0
*                        3: CPOL=1, CPHA=1
*                br_data -
*                    Setting of QSPI Bit Rate Register (SPBR)
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_change(uint8_t channel, uint8_t mode_num, uint8_t br_data)
{
    uint16_t tmp_mode;
    
    /* Cast the variable to a uint16_t type. */
    tmp_mode = (uint16_t)(SPCMD_MASK_CLK_MODE & ((uint16_t)mode_num));
    
    /* Set bit rate. */
    QSPI_SPBR(channel)      = br_data;
    
    /* ---- Change SPI clock mode. ---- */
    /* Cast the variable to a uint16_t type. */
    QSPI_SPCMD0(channel)    = (uint16_t)((QSPI_SPCMD0(channel) & ~SPCMD_MASK_CLK_MODE) | tmp_mode);
    QSPI_SPCMD1(channel)    = (uint16_t)((QSPI_SPCMD1(channel) & ~SPCMD_MASK_CLK_MODE) | tmp_mode);
    QSPI_SPCMD2(channel)    = (uint16_t)((QSPI_SPCMD2(channel) & ~SPCMD_MASK_CLK_MODE) | tmp_mode);
    if (0 == QSPI_SPCMD2(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_data_set_long
* Description  : Writes longword data to QSPI Data Register.
* Arguments    : channel -
*                    Which channel to use
*                set_data -
*                    Data to be written
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_data_set_long(uint8_t channel, uint32_t set_data)
{
    QSPI_SPDR_LONG(channel) = set_data;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_data_set_byte
* Description  : Writes byte data to QSPI Data Register.
* Arguments    : channel -
*                    Which channel to use
*                set_data -
*                    Data to be written
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_data_set_byte(uint8_t channel, uint8_t set_data)
{
    QSPI_SPDR_BYTE(channel) = set_data;
}


/*******************************************************************************
* Function Name: r_qspi_smstr_data_get_long
* Description  : Reads longword data from QSPI Data Register.
* Arguments    : channel -
*                    Which channel to use
* Return Value : Readout data
*******************************************************************************/
uint32_t r_qspi_smstr_data_get_long(uint8_t channel)
{
    return QSPI_SPDR_LONG(channel);
}


