renesas/rx-driver-package/source/r_qspi_smstr_rx/r_qspi_smstr_rx_vx.xx/r_qspi_smstr_rx/src/targets/rx71m/r_qspi_smstr_target.c
    /* ==== Set sequence control and SPI operation mode. ==== */
    /* NOTE: When all the commands configuring sequence are dual-/quad-SPI read operations, the sequential operation
             is continued as long as the receive buffer is not empty for the receive data.
             To terminate read operation, execute write operation with transmission buffer empty
             as the last sequence. */
    if ((QSPI_FIFO_HALF_SIZE <= size) && (0 != (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) + n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ---- */
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ2;  /* Sequence length = 3                                      */
        QSPI_SPRW0(channel)     = 1;                /* SPCMD0 : Read operation                                  */
        QSPI_SPIMOD0(channel)   = 2;                /* SPCMD0 : Quad-SPI                                        */
        QSPI_SSLKP0(channel)    = 1;                /* Keeps the QSSL signal level from the end of the transfer
                                                       to the beginning of the next access.                     */
        QSPI_SPRW1(channel)     = 1;                /* SPCMD1 : Read operation                                  */
        QSPI_SPIMOD1(channel)   = 2;                /* SPCMD1 : Quad-SPI                                        */
        QSPI_SSLKP1(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        QSPI_SPRW2(channel)     = 0;                /* SPCMD2 : Write operation (To terminate read operation.)  */
        QSPI_SPIMOD2(channel)   = 2;                /* SPCMD2 : Quad-SPI                                        */
        if (0 == QSPI_SPIMOD2(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else
    {
        /* ---- Size of data : (16 * m) bytes or n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ----*/
        QSPI_SPSCR(channel)     = QSPI_SPSCR_SEQ1;  /* Sequence length = 2                                      */
        QSPI_SPRW0(channel)     = 1;                /* SPCMD0 : Read operation                                  */
        QSPI_SPIMOD0(channel)   = 2;                /* SPCMD0 : Quad-SPI                                        */
        QSPI_SSLKP0(channel)    = 0;                /* Negate QSSL signal upon completion of transfer.          */
        QSPI_SPRW1(channel)     = 0;                /* SPCMD1 : Write operation (To terminate read operation.)  */
        QSPI_SPIMOD1(channel)   = 2;                /* SPCMD1 : Quad-SPI                                        */
        if (0 == QSPI_SPIMOD1(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }

    r_qspi_smstr_mpc_enable(channel);               /* MPC : use as I/O port for QSPI.                          */
    QSPI_SPCR(channel)  = QSPI_SPCR_RX_DUALQUAD;    /* Enable reception.                                        */
    if (QSPI_SPCR_RX_DUALQUAD == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_rx_disable
* Description  : Disables QSPI reception.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_rx_disable(uint8_t channel)
{
    r_qspi_smstr_mpc_disable(channel);              /* MPC : use as general I/O port.                           */
    QSPI_SPCR(channel)  = QSPI_SPCR_INIT;           /* Disable reception.                                       */
    if (QSPI_SPCR_INIT == QSPI_SPCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    r_qspi_smstr_spsr_clear(channel);               /* Clear status flag of QSPI.                               */
    QSPI_SPSCR(channel) = QSPI_SPSCR_INIT;          /* Initialize sequence length.                              */
    if (QSPI_SPSCR_INIT == QSPI_SPSCR(channel))
    {
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_buffer_reset
* Description  : Resets transmit and receive buffer of QSPI.
* Arguments    : channel -
*                    Which channel to use.
* Return Value : none
*******************************************************************************/
static void r_qspi_smstr_buffer_reset(uint8_t channel)
{
    QSPI_SPBFCR(channel)    = QSPI_SPBFCR_RST;      /* Reset transmit and receive buffer.                       */
    if (QSPI_SPBFCR_RST == QSPI_SPBFCR(channel))
    {
        /* According to specifications of QSPI,
           if write SPBFCR, must execute dummy reading. */
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
    QSPI_SPBFCR(channel)    = QSPI_SPBFCR_INIT;     /* Allow transmit and receive buffer normal operation.      */
    if (QSPI_SPBFCR_INIT == QSPI_SPBFCR(channel))
    {
        /* According to specifications of QSPI,
           if write SPBFCR, must execute dummy reading. */
        /* Wait for the write completion. */
        R_BSP_NOP();
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_datasize_set
* Description  : Sets data size to the SFR for QSPI.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data.
* Return Value : none
*******************************************************************************/
static void r_qspi_smstr_datasize_set(uint8_t channel, uint32_t size)
{
    if ((QSPI_FIFO_HALF_SIZE <= size) && (0 != (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) + n bytes (m=0x00000001~0x0FFFFFFF, n=0x00000001~0x0000000F) ---- */
        QSPI_SPBFCR(channel)    = QSPI_SPBFCR_FIFO_HALF_SIZE;           /* Buffer triggering number : 16 bytes  */
        if (QSPI_SPBFCR_FIFO_HALF_SIZE == QSPI_SPBFCR(channel))
        {
            /* According to specifications of QSPI,
               if write SPBFCR, must execute dummy reading. */
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
        QSPI_SPB0(channel)      = SPCMD_SPB_LONG;                       /* Transfer data length : 32 bits       */

        /* Cast the variable to a uint32_t type. */
        QSPI_SPBMUL0(channel) = (uint32_t)((size / QSPI_FIFO_HALF_SIZE) * (QSPI_FIFO_HALF_SIZE / QSPI_SMSTR_TRAN_SIZE));
                                                                        /* Number of times to transfer 32 bits. */
        QSPI_SPB1(channel)      = SPCMD_SPB_BYTE;                       /* Transfer data length : 8 bits        */

        /* Cast the variable to a uint32_t type. */
        QSPI_SPBMUL1(channel)   = (uint32_t)(size % QSPI_FIFO_HALF_SIZE);
                                                                        /* Number of times to transfer 8 bits.  */
        if (0 == QSPI_SPBMUL1(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else if ((QSPI_FIFO_HALF_SIZE <= size) && (0 == (QSPI_FIFO_CHK & size)))
    {
        /* ---- Size of data : (16 * m) bytes (m=0x00000001~0x0FFFFFFF) ---- */
        QSPI_SPBFCR(channel)    = QSPI_SPBFCR_FIFO_HALF_SIZE;           /* Buffer triggering number : 16 bytes  */
        if (QSPI_SPBFCR_FIFO_HALF_SIZE == QSPI_SPBFCR(channel))
        {
            /* According to specifications of QSPI,
               if write SPBFCR, must execute dummy reading. */
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
        QSPI_SPB0(channel)      = SPCMD_SPB_LONG;                       /* Transfer data length : 32 bits       */

        /* Cast the variable to a uint32_t type. */
        QSPI_SPBMUL0(channel) = (uint32_t)((size / QSPI_FIFO_HALF_SIZE) * (QSPI_FIFO_HALF_SIZE / QSPI_SMSTR_TRAN_SIZE));
                                                                        /* Number of times to transfer 32 bits. */
        if (0 == QSPI_SPBMUL0(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
    else
    {
        /* ---- Size of data : n bytes (n=0x00000001~0x0000000F) ---- */
        QSPI_SPBFCR(channel)    = QSPI_SPBFCR_BYTE;                     /* Buffer triggering number : 1 byte    */
        if (QSPI_SPBFCR_BYTE == QSPI_SPBFCR(channel))
        {
            /* According to specifications of QSPI,
               if write SPBFCR, must execute dummy reading. */
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
        QSPI_SPB0(channel)      = SPCMD_SPB_BYTE;                       /* Transfer data length : 8 bits        */

        /* Cast the variable to a uint32_t type */
        QSPI_SPBMUL0(channel)   = (uint32_t)(size);                     /* Number of times to transfer 8 bits.  */
        if (0 == QSPI_SPBMUL0(channel))
        {
            /* Wait for the write completion. */
            R_BSP_NOP();
        }
    }
}


/*******************************************************************************
* Function Name: r_qspi_smstr_get_buffregaddress
* Description  : Gets address of QSPI data register (SPDR).
* Arguments    : channel -
*                    Which channel to use
*                p_spdr_adr -
*                    Address of QSPI data register (SPDR)
* Return Value : none
*******************************************************************************/
void r_qspi_smstr_get_buffregaddress(uint8_t channel, uint32_t *p_spdr_adr)
{
    *p_spdr_adr = (uint32_t)(&QSPI_SPDR_LONG(channel));
}


#endif /* #if defined(BSP_MCU_RX71M) */

/* End of File */

